#language: ru

Функционал: Яндекс.Маркет

  Сценарий: Наушники

    Когда осуществлен переход в Яндекс.Маркет
    То выбран подраздел "Наушники" раздела Электроника
    Когда осуществлен переход к расширенному поиску
    Тогда задан параметр поиска стоимость от 5000 рублей
    И установлен фильтр по производителю: Beats
    И осуществлено нажатие на кнопку Показать результат
    Тогда проверено, что отображено 12 результатов
    И сохранено название результата № 1 и осуществлен новый поиск по этому названию
    Тогда проверено, что результат нового поиска соответствует сохраненному значению