#language: ru

Функционал: Яндекс.Маркет

  Сценарий: Телевизоры

    Когда осуществлен переход в Яндекс.Маркет
    То выбран подраздел "Телевизоры" раздела Электроника
    Когда осуществлен переход к расширенному поиску
    Тогда задан параметр поиска стоимость от 20000 рублей
    И установлен фильтр по производителю: LG и Samsung
    И осуществлено нажатие на кнопку Показать результат
    Тогда проверено, что отображено 12 результатов
    И сохранено название результата № 1 и осуществлен новый поиск по этому названию
    Тогда проверено, что результат нового поиска соответствует сохраненному значению